{"_id":{"$oid":"63c986cd5eeffa0818a04c7d"},"Title":"Silence of the Lambs","Description":"A young FBI cade must receive the help of an incarcerated and manipulative cannibal killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Johnathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true,"Actors":["Anthony Hopkins"]}
{"_id":{"$oid":"63c990deacadf3a064e8a933"},"Title":"Jurassic Park","Description":"A pragmatic paleontologist touring an almost complete theme park on an island in Central America is tasked with protecting a couple of kids after a power failure causes the parks cloned dinosaurs to run amok.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense thriller or suspense film, is a broad film genre that involves excitement and suspense in the audience. Tension is created by delaying what the audience sees as inevitable, and is built through situations that are menacing or where escape seems impossible."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Spielberg is an American director, producer, and screenwriter.","Birth":"1946"},"ImagePath":"jurassicpark.png","Featured":true}
{"_id":{"$oid":"63c996b47196d41ac1c646b7"},"Title":"Schindler's List","Description":"In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.","Genre":{"Name":"Drama","Description":"Should contain numerous conscutive scenes of characters portrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Spielberg is an American director, producer, and screenwriter.","Birth":"1946"},"ImagePath":"SchindlersList.png","Featured":true}
{"_id":{"$oid":"63c9985c7196d41ac1c646b8"},"Title":"Avatar","Description":"A paraplegic Marine dispatched to hte moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"James Cameron","Bio":"James Cameron is a Canadian producer, writer, and director.","Birth":"1954"},"ImagePath":"Avatar.png","Featured":true}
{"_id":{"$oid":"63ca49043d10e8440cf8e575"},"Title":"The Shawshank Redemption","Description":"Over the course of several years, two convicts form a friendship, seeking consolation and, eventually, redemption through basic compassion.","Genre":{"Name":"Drama","Description":"Should contain numerous consecutive scenes of characters portrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions. This can be exaggerated upon to produce melodrama."},"Director":{"Name":"Frank Darabont","Bio":"Frank Darabont is an American film director, screenwriter and producer. He has been nominated for three Academy Awards and a Golden Globe Award.","Birth":"1981"},"ImagePath":"theshawshankredemption.png","Actors":["Tim Robbins","Morgan Freeman"],"Featured":true}
{"_id":{"$oid":"63ca4c3734f20c8a8fc7c5f9"},"Title":"The Godfather","Description":"The aging patriarch of an organized crime dynasty in postwar New York City transfers control of his clandestine empire to his reluctant youngest son.","Genre":{"Name":"Drama","Description":"Should contain numerous consecutive scenes of characters portrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions. This can be exaggerated upon to produce melodrama."},"Director":{"Name":"Francis Ford Coppola","Bio":"Francis Ford Coppola is an American film director, producer, and screenwriter. He is considered one of the major figures of the New Hollywood filmmaking movement of the 1960s and 1970s.","Birth":"1939"},"ImagePath":"thegodfather.png","Featured":true,"Actors":["Marlon Brando","Al Pacino"]}
{"_id":{"$oid":"63ca4e2b5a1452ce7e3d3d26"},"Title":"The Dark Knight","Description":"When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats. The genre tends to feature a mostly resourceful hero struggling against incredible odds, which include life-threatening situations, a dangerous villain, or a pursuit which usually concludes in victory for the hero."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is an acclaimed writer-director from London, England and is best known for his cerebral and nonlinear storytelling.","Birth":"1970"},"ImagePath":"thedarkknight.png","Featured":true,"Actors":["Christian Bale","Heath Ledger","Morgan Freeman"]}
{"_id":{"$oid":"63ca560089ee3ff394d425dd"},"Title":"12 Angry Men","Description":"The jury in a New York City murder trial is frustrated by a single member whose skeptical caution forces them to more carefully consider the evidence before jumping to a hasty verdict.","Genre":{"Name":"Drama","Description":"Should contain numerous consecutive scenes of characters portrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions. This can be exaggerated upon to produce melodrama."},"Director":{"Name":"Sidney Lumet","Bio":"Sidney Arthur Lumet was an American film director. He was nominated five times for the Academy Award: four for Best Director for 12 Angry Men, Dog Day Afternoon, Network, and The Verdict and one for Best Adapted Screenplay for Prince of the City.","Birth":"1924","Death":"2011"},"ImagePath":"twelveangrymen.png","Featured":true}
{"_id":{"$oid":"63ca5760b6d0e6552f8c4d3d"},"Title":"Pulp Fiction","Description":"The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.","Genre":{"Name":"Drama","Description":"Should contain numerous consecutive scenes of characters portrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions. This can be exaggerated upon to produce melodrama."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino is an American film director, writer, producer, and actor. His films are characterized by frequent references to popular culture and film genres, non-linear storylines, dark humor, stylized violence, extended dialogue, pervasive use of profanity, cameos and ensemble casts.","Birth":"1963"},"ImagePath":"pulpfiction.png","Featured":true,"Actors":["John Travolta","Uma Thurman","Samuel L Jackson","Bruce Willis"]}
{"_id":{"$oid":"63ca58fc83c83b3e4d9e3f7f"},"Title":"Interstellar","Description":"A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.","Genre":{"Name":"Scifi","Description":"Science fiction, popularly shortened as sci-fi, is a genre of fiction that creatively depicts real or imaginary science and technology as part of its plot, setting, or theme. The fiction part of science fiction means, of course, that it's a fictional story—not a real-life account."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is an acclaimed writer-director from London, England and is best known for his cerebral and nonlinear storytelling.","Birth":"1970"},"ImagePath":"interstellar.png","Actors":["Matthew McConaughey","Anne Hathaway","Jessica Chastain"],"Featured":true}
